In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv("guazi.csv")

In [3]:
data

,leixing,nianfen,licheng,didian,shoujia,yuanjia
0,凯迪拉克ATS-L 2016款 28T 时尚型,2016年,2.5万公里,长沙,16.77万,34.60万
1,奥迪A6L 2014款 TFSI 标准型,2014年,13.8万公里,长沙,21.96万,44.50万
2,本田 思域 2016款 1.8L 自动舒适版,2016年,4.8万公里,长沙,8.87万,15.20万
3,大众 朗逸 2015款 1.6L 自动舒适版,2016年,10.5万公里,长沙,7.27万,14.90万
4,leixing,nianfen,licheng,didian,shoujia,yuanjia
...,...,...,...,...,...,...
2005,大众 途观 2013款 1.8TSI 自动两驱舒适版,2014年,7.3万公里,长沙,13.50万,25.80万
2006,现代ix35 2012款 2.0L 自动两驱精英版GLS,2012年,7.1万公里,长沙,8.00万,21.30万
2007,宝马3系 2014款 320Li 时尚型,2015年,4.6万公里,长沙,23.00万,38.90万
2008,标致308 2014款 乐享版 经典 1.6L 手动优尚型,2015年,3.0万公里,长沙,6.20万,11.50万
2009,大众POLO 2014款 1.6L 自动舒适版,2016年,2.9万公里,长沙,7.40万,11.30万

In [4]:
data1 = pd.Series(['a','b',np.nan,'d'])
data1

0      a
1      b
2    NaN
3      d
dtype: object

In [5]:
data1.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
data1[~data1.isnull()]

0    a
1    b
3    d
dtype: object

In [7]:
data1[0]=None
data1[~data1.isnull()]

1    b
3    d
dtype: object

In [9]:
data1.dropna()

1    b
3    d
dtype: object

In [12]:
data1[data1.notnull()]

1    b
3    d
dtype: object

In [40]:
data2 = pd.DataFrame([[1.,6.5,3.],[1.,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.7,7.]])
data2_copy = data2.copy()
data2

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.7  7.0

In [41]:
data2.isnull()
data2.notnull()

       0      1      2
0   True   True   True
1   True  False  False
2  False  False  False
3  False   True   True

In [42]:
data2.dropna(inplace=True)
data2

     0    1    2
0  1.0  6.5  3.0

In [43]:
data2 = data2_copy
# 丢弃全为nan的行
data2.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.7  7.0

In [44]:
data2.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [102]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  0.442875 -0.391911 -0.313036
1  1.929039 -0.600828  0.264467
2 -0.212780 -0.331280 -1.135832
3  1.551330 -0.308834  0.072873
4  0.602339  0.512957  0.113876
5 -1.556692 -0.689686  0.254239
6 -0.303798  0.708130 -0.007351

In [103]:
df.loc[:2,1] = np.nan

In [104]:
df

          0         1         2
0  0.442875       NaN -0.313036
1  1.929039       NaN  0.264467
2 -0.212780       NaN -1.135832
3  1.551330 -0.308834  0.072873
4  0.602339  0.512957  0.113876
5 -1.556692 -0.689686  0.254239
6 -0.303798  0.708130 -0.007351

In [105]:
df.dropna(axis=1)

          0         2
0  0.442875 -0.313036
1  1.929039  0.264467
2 -0.212780 -1.135832
3  1.551330  0.072873
4  0.602339  0.113876
5 -1.556692  0.254239
6 -0.303798 -0.007351

In [107]:
df.loc[1] = np.nan
df.iloc[[0,2],[2,2]] = np.nan
df

          0         1         2
0  0.442875       NaN       NaN
1       NaN       NaN       NaN
2 -0.212780       NaN       NaN
3  1.551330 -0.308834  0.072873
4  0.602339  0.512957  0.113876
5 -1.556692 -0.689686  0.254239
6 -0.303798  0.708130 -0.007351

In [108]:
df.dropna(how="all")

          0         1         2
0  0.442875       NaN       NaN
2 -0.212780       NaN       NaN
3  1.551330 -0.308834  0.072873
4  0.602339  0.512957  0.113876
5 -1.556692 -0.689686  0.254239
6 -0.303798  0.708130 -0.007351

In [109]:
df.dropna(thresh=2)

          0         1         2
3  1.551330 -0.308834  0.072873
4  0.602339  0.512957  0.113876
5 -1.556692 -0.689686  0.254239
6 -0.303798  0.708130 -0.007351

In [111]:
df.fillna(0)

          0         1         2
0  0.442875  0.000000  0.000000
1  0.000000  0.000000  0.000000
2 -0.212780  0.000000  0.000000
3  1.551330 -0.308834  0.072873
4  0.602339  0.512957  0.113876
5 -1.556692 -0.689686  0.254239
6 -0.303798  0.708130 -0.007351

In [112]:
df.fillna({1:0.9,2:0})

          0         1         2
0  0.442875  0.900000  0.000000
1       NaN  0.900000  0.000000
2 -0.212780  0.900000  0.000000
3  1.551330 -0.308834  0.072873
4  0.602339  0.512957  0.113876
5 -1.556692 -0.689686  0.254239
6 -0.303798  0.708130 -0.007351

In [113]:
df2 = pd.DataFrame(np.random.randn(6,3))
df2.iloc[2:,1] = np.nan
df2.iloc[4:,2] = np.nan
df2

          0         1         2
0 -0.899995 -0.649655 -0.169207
1  0.537092  0.057859 -0.842183
2  0.132662       NaN -0.505905
3  0.743099       NaN -0.824162
4  0.200287       NaN       NaN
5 -0.625181       NaN       NaN

In [115]:
df2.fillna(method="ffill")

          0         1         2
0 -0.899995 -0.649655 -0.169207
1  0.537092  0.057859 -0.842183
2  0.132662  0.057859 -0.505905
3  0.743099  0.057859 -0.824162
4  0.200287  0.057859 -0.824162
5 -0.625181  0.057859 -0.824162

,leixing,nianfen,licheng,didian,shoujia,yuanjia
0,凯迪拉克ATS-L 2016款 28T 时尚型,2016年,2.5万公里,长沙,16.77万,34.60万
1,奥迪A6L 2014款 TFSI 标准型,2014年,13.8万公里,长沙,21.96万,44.50万
2,本田 思域 2016款 1.8L 自动舒适版,2016年,4.8万公里,长沙,8.87万,15.20万
3,大众 朗逸 2015款 1.6L 自动舒适版,2016年,10.5万公里,长沙,7.27万,14.90万
4,leixing,nianfen,licheng,didian,shoujia,yuanjia
...,...,...,...,...,...,...
2005,大众 途观 2013款 1.8TSI 自动两驱舒适版,2014年,7.3万公里,长沙,13.50万,25.80万
2006,现代ix35 2012款 2.0L 自动两驱精英版GLS,2012年,7.1万公里,长沙,8.00万,21.30万
2007,宝马3系 2014款 320Li 时尚型,2015年,4.6万公里,长沙,23.00万,38.90万
2008,标致308 2014款 乐享版 经典 1.6L 手动优尚型,2015年,3.0万公里,长沙,6.20万,11.50万
2009,大众POLO 2014款 1.6L 自动舒适版,2016年,2.9万公里,长沙,7.40万,11.30万

In [120]:
df= pd.DataFrame({"data1":["a"]*4 + ["b"]*4, "data2": np.random.randint(0,4,8)})
df

  data1  data2
0     a      2
1     a      0
2     a      1
3     a      3
4     b      0
5     b      3
6     b      2
7     b      2

In [121]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [122]:
df[~df.duplicated()]

  data1  data2
0     a      2
1     a      0
2     a      1
3     a      3
4     b      0
5     b      3
6     b      2

In [129]:
df.drop_duplicates()

  data1  data2
0     a      2
1     a      0
2     a      1
3     a      3
4     b      0
5     b      3
6     b      2

In [130]:
df['v1'] = range(8)

In [133]:
df.drop_duplicates("data1")

  data1  data2  v1
0     a      2   0
4     b      0   4

In [134]:
df.drop_duplicates("v1")

  data1  data2  v1
0     a      2   0
1     a      0   1
2     a      1   2
3     a      3   3
4     b      0   4
5     b      3   5
6     b      2   6
7     b      2   7

In [136]:
df.drop_duplicates(["data1","data2"])

  data1  data2  v1
0     a      2   0
1     a      0   1
2     a      1   2
3     a      3   3
4     b      0   4
5     b      3   5
6     b      2   6

In [137]:
df.drop_duplicates("data1",keep="last")

  data1  data2  v1
3     a      3   3
7     b      2   7

In [52]:
data = pd.DataFrame({'food': ['Apple', 'banana', 'orange','apple','Mango', 'tomato'],
                    'price': [4, 3, 3.5, 6, 12,3]})
data

     food  price
0   Apple    4.0
1  banana    3.0
2  orange    3.5
3   apple    6.0
4   Mango   12.0
5  tomato    3.0

In [53]:
data["food"].str.lower()

0     apple
1    banana
2    orange
3     apple
4     mango
5    tomato
Name: food, dtype: object

In [54]:
meat = {'apple':'fruit',
       'banana':'fruit',
       'orange':'fruit',
       'mango':'fruit',
       'tomato':'vagetables'}

In [55]:
data["class"] = data["food"].str.lower().map(meat)
data

     food  price       class
0   Apple    4.0       fruit
1  banana    3.0       fruit
2  orange    3.5       fruit
3   apple    6.0       fruit
4   Mango   12.0       fruit
5  tomato    3.0  vagetables

In [56]:
data["class1"] = data["food"].map(lambda x: meat[x.lower()])
data

     food  price       class      class1
0   Apple    4.0       fruit       fruit
1  banana    3.0       fruit       fruit
2  orange    3.5       fruit       fruit
3   apple    6.0       fruit       fruit
4   Mango   12.0       fruit       fruit
5  tomato    3.0  vagetables  vagetables

In [58]:
data["food"].str.lower()

0     apple
1    banana
2    orange
3     apple
4     mango
5    tomato
Name: food, dtype: object

In [59]:
data["class1"] = (data["food"].str.lower()).map(meat)
data

     food  price       class      class1
0   Apple    4.0       fruit       fruit
1  banana    3.0       fruit       fruit
2  orange    3.5       fruit       fruit
3   apple    6.0       fruit       fruit
4   Mango   12.0       fruit       fruit
5  tomato    3.0  vagetables  vagetables

In [157]:
type(data["food"])

pandas.core.series.Series

In [163]:
food = data["food"]
food

0     Apple
1    banana
2    orange
3     apple
4     Mango
5    tomato
Name: food, dtype: object

In [164]:
data = pd.Series([1,-999,2,-1000,3,4,5,6,7])
data

0       1
1    -999
2       2
3   -1000
4       3
5       4
6       5
7       6
8       7
dtype: int64

In [165]:
data.replace(1,np.nan)

0       NaN
1    -999.0
2       2.0
3   -1000.0
4       3.0
5       4.0
6       5.0
7       6.0
8       7.0
dtype: float64

In [167]:
data.replace([1,2,3],np.nan)

0       NaN
1    -999.0
2       NaN
3   -1000.0
4       NaN
5       4.0
6       5.0
7       6.0
8       7.0
dtype: float64

In [168]:
data.replace([1,2,3],[np.nan,1000,100000])

0         NaN
1      -999.0
2      1000.0
3     -1000.0
4    100000.0
5         4.0
6         5.0
7         6.0
8         7.0
dtype: float64

In [169]:
data.replace({1:200,2:300,3:500})

0     200
1    -999
2     300
3   -1000
4     500
5       4
6       5
7       6
8       7
dtype: int64

In [170]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['BeiJing', 'Tokyo', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
BeiJing     0    1      2     3
Tokyo       4    5      6     7
New York    8    9     10    11

In [172]:
data.reindex(['Tokyo', 'BeiJing', 'New York'])

          one  two  three  four
Tokyo       4    5      6     7
BeiJing     0    1      2     3
New York    8    9     10    11

In [173]:
data.reindex(["a","Tokyo","c"])

       one  two  three  four
a      NaN  NaN    NaN   NaN
Tokyo  4.0  5.0    6.0   7.0
c      NaN  NaN    NaN   NaN

In [182]:
data.index = data.index.map(lambda x: x.upper())

In [188]:
data=data.rename(index=str.title, columns=str.title)
data

          One  Two  Three  Four
Beijing     0    1      2     3
Tokyo       4    5      6     7
New York    8    9     10    11

In [191]:
data.rename(index={"Beijing":"bj","Tokyo":"ty","New York":"ny"}, columns=str.title, inplace=True)

In [192]:
#离散化和面元划分 ---- 分阶段

In [202]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [0,10,20,30,40,50]

In [205]:
cats = pd.cut(ages, bins)
cats

[(10, 20], (20, 30], (20, 30], (20, 30], (20, 30], ..., (30.0, 40.0], NaN, (40.0, 50.0], (40.0, 50.0], (30.0, 40.0]]
Length: 12
Categories (5, interval[int64]): [(0, 10] < (10, 20] < (20, 30] < (30, 40] < (40, 50]]

In [204]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [213]:
cats.codes

array([ 1,  2,  2,  2,  2,  2,  3,  3, -1,  4,  4,  3], dtype=int8)

In [214]:
cats.categories

IntervalIndex([(0, 10], (10, 20], (20, 30], (30, 40], (40, 50]],
              closed='right',
              dtype='interval[int64]')

In [216]:
pd.value_counts(cats)

(20, 30]    5
(30, 40]    3
(40, 50]    2
(10, 20]    1
(0, 10]     0
dtype: int64

In [221]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [223]:
names = ['青年','壮年','中年','老年']

In [225]:
bins = [18,26,36,61,100]
cats = pd.cut(ages,bins,labels=names)
cats

['青年', '青年', '青年', '壮年', '青年', ..., '壮年', '中年', '中年', '中年', '壮年']
Length: 12
Categories (4, object): ['青年' < '壮年' < '中年' < '老年']

In [227]:
help(pd.cut)

Help on function cut in module pandas.core.reshape.tile:

cut(x, bins, right: bool = True, labels=None, retbins: bool = False, precision: int = 3, include_lowest: bool = False, duplicates: str = 'raise', ordered: bool = True)
    Bin values into discrete intervals.

    Use `cut` when you need to segment and sort data values into bins. This
    function is also useful for going from a continuous variable to a
    categorical variable. For example, `cut` could convert ages to groups of
    age ranges. Supports binning into an equal number of bins, or a
    pre-specified array of bins.

    Parameters
    ----------
    x : array-like
        The input array to be binned. Must be 1-dimensional.
    bins : int, sequence of scalars, or IntervalIndex
        The criteria to bin by.

        * int : Defines the number of equal-width bins in the range of `x`. The
          range of `x` is extended by .1% on each side to include the minimum
          and maximum values of `x`.
        * sequence of scalars : Defines the bin edges allowing for non-uniform
          width. No extension of the range of `x` is done.
        * IntervalIndex : Defines the exact bins to be used. Note that
          IntervalIndex for `bins` must be non-overlapping.

    right : bool, default True
        Indicates whether `bins` includes the rightmost edge or not. If
        ``right == True`` (the default), then the `bins` ``[1, 2, 3, 4]``
        indicate (1,2], (2,3], (3,4]. This argument is ignored when
        `bins` is an IntervalIndex.
    labels : array or False, default None
        Specifies the labels for the returned bins. Must be the same length as
        the resulting bins. If False, returns only integer indicators of the
        bins. This affects the type of the output container (see below).
        This argument is ignored when `bins` is an IntervalIndex. If True,
        raises an error. When `ordered=False`, labels must be provided.
    retbins : bool, default False
        Whether to return the bins or not. Useful when bins is provided
        as a scalar.
    precision : int, default 3
        The precision at which to store and display the bins labels.
    include_lowest : bool, default False
        Whether the first interval should be left-inclusive or not.
    duplicates : {default 'raise', 'drop'}, optional
        If bin edges are not unique, raise ValueError or drop non-uniques.
    ordered : bool, default True
        Whether the labels are ordered or not. Applies to returned types
        Categorical and Series (with Categorical dtype). If True,
        the resulting categorical will be ordered. If False, the resulting
        categorical will be unordered (labels must be provided).

        .. versionadded:: 1.1.0

    Returns
    -------
    out : Categorical, Series, or ndarray
        An array-like object representing the respective bin for each value
        of `x`. The type depends on the value of `labels`.

        * True (default) : returns a Series for Series `x` or a
          Categorical for all other inputs. The values stored within
          are Interval dtype.

        * sequence of scalars : returns a Series for Series `x` or a
          Categorical for all other inputs. The values stored within
          are whatever the type in the sequence is.

        * False : returns an ndarray of integers.

    bins : numpy.ndarray or IntervalIndex.
        The computed or specified bins. Only returned when `retbins=True`.
        For scalar or sequence `bins`, this is an ndarray with the computed
        bins. If set `duplicates=drop`, `bins` will drop non-unique bin. For
        an IntervalIndex `bins`, this is equal to `bins`.

    See Also
    --------
    qcut : Discretize variable into equal-sized buckets based on rank
        or based on sample quantiles.
    Categorical : Array type for storing data that come from a
        fixed set of values.
    Series : One-dimensional array with axis labels (including time series).
    IntervalIndex : Immutable Index implementing an ordered, sliceable set.

    Notes
    -----
    Any NA values will be NA in the result. Out of bounds values will be NA in
    the resulting Series or Categorical object.

    Examples
    --------
    Discretize into three equal-sized bins.

    >>> pd.cut(np.array([1, 7, 5, 4, 6, 3]), 3)
    ... # doctest: +ELLIPSIS
    [(0.994, 3.0], (5.0, 7.0], (3.0, 5.0], (3.0, 5.0], (5.0, 7.0], ...
    Categories (3, interval[float64]): [(0.994, 3.0] < (3.0, 5.0] ...

    >>> pd.cut(np.array([1, 7, 5, 4, 6, 3]), 3, retbins=True)
    ... # doctest: +ELLIPSIS
    ([(0.994, 3.0], (5.0, 7.0], (3.0, 5.0], (3.0, 5.0], (5.0, 7.0], ...
    Categories (3, interval[float64]): [(0.994, 3.0] < (3.0, 5.0] ...
    array([0.994, 3.   , 5.   , 7.   ]))

    Discovers the same bins, but assign them specific labels. Notice that
    the returned Categorical's categories are `labels` and is ordered.

    >>> pd.cut(np.array([1, 7, 5, 4, 6, 3]),
    ...        3, labels=["bad", "medium", "good"])
    ['bad', 'good', 'medium', 'medium', 'good', 'bad']
    Categories (3, object): ['bad' < 'medium' < 'good']

    ``ordered=False`` will result in unordered categories when labels are passed.
    This parameter can be used to allow non-unique labels:

    >>> pd.cut(np.array([1, 7, 5, 4, 6, 3]), 3,
    ...        labels=["B", "A", "B"], ordered=False)
    ['B', 'B', 'A', 'A', 'B', 'B']
    Categories (2, object): ['A', 'B']

    ``labels=False`` implies you just want the bins back.

    >>> pd.cut([0, 1, 1, 2], bins=4, labels=False)
    array([0, 1, 1, 3])

    Passing a Series as an input returns a Series with categorical dtype:

    >>> s = pd.Series(np.array([2, 4, 6, 8, 10]),
    ...               index=['a', 'b', 'c', 'd', 'e'])
    >>> pd.cut(s, 3)
    ... # doctest: +ELLIPSIS
    a    (1.992, 4.667]
    b    (1.992, 4.667]
    c    (4.667, 7.333]
    d     (7.333, 10.0]
    e     (7.333, 10.0]
    dtype: category
    Categories (3, interval[float64]): [(1.992, 4.667] < (4.667, ...

    Passing a Series as an input returns a Series with mapping value.
    It is used to map numerically to intervals based on bins.

    >>> s = pd.Series(np.array([2, 4, 6, 8, 10]),
    ...               index=['a', 'b', 'c', 'd', 'e'])
    >>> pd.cut(s, [0, 2, 4, 6, 8, 10], labels=False, retbins=True, right=False)
    ... # doctest: +ELLIPSIS
    (a    1.0
     b    2.0
     c    3.0
     d    4.0
     e    NaN
     dtype: float64,
     array([ 0,  2,  4,  6,  8, 10]))

    Use `drop` optional when bins is not unique

    >>> pd.cut(s, [0, 2, 4, 6, 10, 10], labels=False, retbins=True,
    ...        right=False, duplicates='drop')
    ... # doctest: +ELLIPSIS
    (a    1.0
     b    2.0
     c    3.0
     d    3.0
     e    NaN
     dtype: float64,
     array([ 0,  2,  4,  6, 10]))

    Passing an IntervalIndex for `bins` results in those categories exactly.
    Notice that values not covered by the IntervalIndex are set to NaN. 0
    is to the left of the first bin (which is closed on the right), and 1.5
    falls between two bins.

    >>> bins = pd.IntervalIndex.from_tuples([(0, 1), (2, 3), (4, 5)])
    >>> pd.cut([0, 0.5, 1.5, 2.5, 4.5], bins)
    [NaN, (0.0, 1.0], NaN, (2.0, 3.0], (4.0, 5.0]]
    Categories (3, interval[int64]): [(0, 1] < (2, 3] < (4, 5]]

In [229]:
data = np.random.rand(20)
data

array([0.93193245, 0.14612703, 0.221254  , 0.3803977 , 0.50395183,
       0.10820836, 0.10671384, 0.78513345, 0.65446781, 0.06988667,
       0.66322619, 0.03907709, 0.35220395, 0.44298566, 0.45549412,
       0.25166618, 0.92585713, 0.28561737, 0.35811512, 0.70718505])

In [230]:
pd.cut(data,4,precision=2)

[(0.71, 0.93], (0.038, 0.26], (0.038, 0.26], (0.26, 0.49], (0.49, 0.71], ..., (0.038, 0.26], (0.71, 0.93], (0.26, 0.49], (0.26, 0.49], (0.49, 0.71]]
Length: 20
Categories (4, interval[float64]): [(0.038, 0.26] < (0.26, 0.49] < (0.49, 0.71] < (0.71, 0.93]]

In [237]:
pd.cut(data,4,precision=2,retbins=True)[1]

[(0.71, 0.93], (0.038, 0.26], (0.038, 0.26], (0.26, 0.49], (0.49, 0.71], ..., (0.038, 0.26], (0.71, 0.93], (0.26, 0.49], (0.26, 0.49], (0.49, 0.71]]
Length: 20
Categories (4, interval[float64]): [(0.038, 0.26] < (0.26, 0.49] < (0.49, 0.71] < (0.71, 0.93]]

In [238]:
pd.cut(data,4,precision=2,retbins=True)[1]

array([0.03818423, 0.26229093, 0.48550477, 0.70871861, 0.93193245])

In [277]:
# qcut函数
data = np.random.randn(100)
data

array([-1.74287977e+00,  6.30627177e-01,  1.23874861e+00, -5.60282704e-01,
       -2.58163825e-01, -1.00885773e+00,  8.87776630e-01,  5.82976815e-01,
        1.02446972e+00,  1.16025660e+00, -8.71607589e-01, -3.00157510e-01,
        2.29623293e+00,  2.43667247e-01,  3.97863481e-01,  1.75736459e-01,
       -5.29747889e-01,  4.87309649e-01,  5.24434634e-02,  1.76099846e+00,
        6.26629573e-01, -1.88813556e-01, -1.17827294e+00, -6.61159008e-02,
       -1.40067212e+00,  9.13903874e-01, -1.14268095e+00, -9.97358406e-01,
       -3.72105431e-01,  1.27347679e+00,  7.19031906e-01,  2.22321651e+00,
        1.68990981e+00,  5.86387519e-01, -6.87299519e-02,  7.77866629e-01,
        4.26744101e-01,  5.83776448e-01,  1.57167930e-01,  9.44537363e-01,
        9.79152204e-02,  1.87428735e+00,  8.73099524e-01, -5.99529391e-01,
       -1.95353012e+00,  2.87134561e-01, -3.61332957e-01, -2.26733701e+00,
        6.25049161e-01,  6.04707494e-01,  1.95850107e+00, -5.16306443e-01,
        1.21733202e-01, -1.02148354e+00, -2.10941918e+00, -3.13125198e-01,
        2.53134260e-01,  1.48513971e+00, -2.68409953e-02,  1.45289115e+00,
       -8.58966011e-01,  9.51242766e-01,  2.41853162e-01,  1.69953143e-01,
        1.46253143e+00,  4.89658149e-01, -5.01433113e-01, -2.88216129e-01,
        7.82847279e-01, -1.93690747e+00, -7.42927368e-01,  4.52882411e-02,
        5.96379275e-01, -5.23390132e-01,  9.63281527e-01,  2.03960957e-01,
       -2.06104282e-01,  1.47491198e+00,  9.98596587e-01,  1.21009283e-03,
        1.35288584e+00,  1.29284081e+00,  2.10733512e+00,  3.58644047e-01,
       -3.54351295e+00,  2.35068178e-01,  9.04080365e-01,  1.63526033e-01,
       -6.23676832e-01,  1.65969600e-01,  4.74226441e-01,  1.98366465e-01,
        8.54447112e-01, -4.70231529e-01, -3.70808260e-01, -1.39573290e-01,
       -2.55489673e-01,  9.69009756e-01, -2.48295703e+00,  9.66892686e-02])

In [278]:
cats=pd.qcut(data,4)
cats

[(-3.545, -0.371], (0.201, 0.877], (0.877, 2.296], (-3.545, -0.371], (-0.371, 0.201], ..., (-0.371, 0.201], (-0.371, 0.201], (0.877, 2.296], (-3.545, -0.371], (-0.371, 0.201]]
Length: 100
Categories (4, interval[float64]): [(-3.545, -0.371] < (-0.371, 0.201] < (0.201, 0.877] < (0.877, 2.296]]

In [279]:
pd.value_counts(cats)

(-3.545, -0.371]    25
(-0.371, 0.201]     25
(0.201, 0.877]      25
(0.877, 2.296]      25
dtype: int64

In [280]:
cats=pd.cut(data,4)
cats

[(-2.084, -0.624], (-0.624, 0.836], (0.836, 2.296], (-0.624, 0.836], (-0.624, 0.836], ..., (-0.624, 0.836], (-0.624, 0.836], (0.836, 2.296], (-3.549, -2.084], (-0.624, 0.836]]
Length: 100
Categories (4, interval[float64]): [(-3.549, -2.084] < (-2.084, -0.624] < (-0.624, 0.836] < (0.836, 2.296]]

In [281]:
pd.value_counts(cats)

(-0.624, 0.836]     56
(0.836, 2.296]      27
(-2.084, -0.624]    13
(-3.549, -2.084]     4
dtype: int64

### 检测和过滤异常值

In [302]:
data = pd.DataFrame(np.random.randn(10, 4))
data

          0         1         2         3
0 -0.048157  0.374769 -1.649567 -0.028322
1  0.582693  1.789404  2.090563 -0.045849
2  0.737947 -1.252676 -0.955208 -0.624878
3 -1.750014 -0.739173 -1.070347 -1.033738
4 -0.006141 -0.603768  0.479659  0.844048
5 -0.803312 -0.758641  1.511357 -0.250288
6  1.417878  0.649350 -0.232154 -0.183820
7  0.389541  0.330550 -1.657683  1.259543
8  0.040182 -0.433048 -0.532172 -0.018140
9 -0.610554  0.619692  1.264227 -0.307142

In [305]:
np.abs(data)>1

       0      1      2      3
0  False  False   True  False
1  False   True   True  False
2  False   True  False  False
3   True  False   True   True
4  False  False  False  False
5  False  False   True  False
6   True  False  False  False
7  False  False   True   True
8  False  False  False  False
9  False  False   True  False

In [318]:
(np.abs(data)>1).all(1)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [321]:
(np.abs(data)>1).any(1)

0     True
1     True
2     True
3     True
4    False
5     True
6     True
7     True
8    False
9     True
dtype: bool

In [324]:
data[np.abs(data)>1]=3
data

          0         1         2         3
0 -0.048157  0.374769  3.000000 -0.028322
1  0.582693  3.000000  3.000000 -0.045849
2  0.737947  3.000000 -0.955208 -0.624878
3  3.000000 -0.739173  3.000000  3.000000
4 -0.006141 -0.603768  0.479659  0.844048
5 -0.803312 -0.758641  3.000000 -0.250288
6  3.000000  0.649350 -0.232154 -0.183820
7  0.389541  0.330550  3.000000  3.000000
8  0.040182 -0.433048 -0.532172 -0.018140
9 -0.610554  0.619692  3.000000 -0.307142

In [325]:
data.describe()

               0          1          2          3
count  10.000000  10.000000  10.000000  10.000000
mean    0.628220   0.543973   1.676012   0.538561
std     1.337963   1.405161   1.744497   1.349750
min    -0.803312  -0.758641  -0.955208  -0.624878
25%    -0.037653  -0.561088  -0.054201  -0.233671
50%     0.214862   0.352660   3.000000  -0.037086
75%     0.699134   0.641935   3.000000   0.628501
max     3.000000   3.000000   3.000000   3.000000

In [326]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [330]:
sam = np.random.permutation(5)
sam

array([4, 2, 3, 1, 0])

In [331]:
df.take(sam)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3

In [333]:
df.index=["a","b","c","d","e"]
df

    0   1   2   3
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15
e  16  17  18  19

In [337]:
df.take(sam)

    0   1   2   3
e  16  17  18  19
c   8   9  10  11
d  12  13  14  15
b   4   5   6   7
a   0   1   2   3

In [338]:
df.reindex(["e","d","c","b","a"])

    0   1   2   3
e  16  17  18  19
d  12  13  14  15
c   8   9  10  11
b   4   5   6   7
a   0   1   2   3

In [341]:
df.sample(n=3)

   0  1   2   3
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [342]:
df.sample(n=3)

   0  1   2   3
c  8  9  10  11
b  4  5   6   7
a  0  1   2   3

In [1]:
import numpy as np
import pandas as pd

In [2]:
val = 'a,b, c'

In [3]:
[i.strip() for i in val.split(",")]

['a', 'b', 'c']

In [8]:
data = {'a': 'dave@qq.com', 'b': 'steve@gmail.com',
        'c': 'sam@gmail.com', 'd': np.nan}
data1 = pd.Series(data)
data1

a        dave@qq.com
b    steve@gmail.com
c      sam@gmail.com
d                NaN
dtype: object

In [16]:
data2 = pd.DataFrame(data1)
data2

                 0
a      dave@qq.com
b  steve@gmail.com
c    sam@gmail.com
d              NaN

In [17]:
data2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [18]:
data1.isnull()

a    False
b    False
c    False
d     True
dtype: bool

In [40]:
data1=data1[~data1.isnull()]

In [41]:
data1.str.split("@")

a        [dave, qq.com]
b    [steve, gmail.com]
c      [sam, gmail.com]
dtype: object

In [42]:
data1.map(lambda x: x.split("@"))

a        [dave, qq.com]
b    [steve, gmail.com]
c      [sam, gmail.com]
dtype: object

In [43]:
data1.str.contains("gmail")

a    False
b     True
c     True
dtype: bool

In [45]:
data1.str.findall("qq")

a    [qq]
b      []
c      []
dtype: object

In [47]:
data1.str[:5]

a    dave@
b    steve
c    sam@g
dtype: object

In [60]:
data2

                 0
a      dave@qq.com
b  steve@gmail.com
c    sam@gmail.com
d              NaN

In [68]:
data2.dropna(axis=0,how="all",inplace=True)
data2[0].map(lambda x: x.split("@"))

a        [dave, qq.com]
b    [steve, gmail.com]
c      [sam, gmail.com]
Name: 0, dtype: object

In [137]:
data = pd.read_csv('guazi.csv')
data

,leixing,nianfen,licheng,didian,shoujia,yuanjia
0,凯迪拉克ATS-L 2016款 28T 时尚型,2016年,2.5万公里,长沙,16.77万,34.60万
1,奥迪A6L 2014款 TFSI 标准型,2014年,13.8万公里,长沙,21.96万,44.50万
2,本田 思域 2016款 1.8L 自动舒适版,2016年,4.8万公里,长沙,8.87万,15.20万
3,大众 朗逸 2015款 1.6L 自动舒适版,2016年,10.5万公里,长沙,7.27万,14.90万
4,leixing,nianfen,licheng,didian,shoujia,yuanjia
...,...,...,...,...,...,...
2005,大众 途观 2013款 1.8TSI 自动两驱舒适版,2014年,7.3万公里,长沙,13.50万,25.80万
2006,现代ix35 2012款 2.0L 自动两驱精英版GLS,2012年,7.1万公里,长沙,8.00万,21.30万
2007,宝马3系 2014款 320Li 时尚型,2015年,4.6万公里,长沙,23.00万,38.90万
2008,标致308 2014款 乐享版 经典 1.6L 手动优尚型,2015年,3.0万公里,长沙,6.20万,11.50万
2009,大众POLO 2014款 1.6L 自动舒适版,2016年,2.9万公里,长沙,7.40万,11.30万

In [138]:
data.duplicated().sum()

9

In [139]:
data=data[~data.duplicated()]
data.count()

leixing    2001
nianfen    2001
licheng    2001
didian     2001
shoujia    2001
yuanjia    1928
dtype: int64

In [140]:
data.describe()

                       leixing nianfen licheng didian shoujia yuanjia
count                     2001    2001    2001   2001    2001    1928
unique                    1276      12     153      2     553     334
top     标致408 2014款 1.8L 自动豪华版   2015年  3.0万公里     长沙   6.00万  11.90万
freq                        11     476      44   2000      63      46

In [141]:
data=data[data.notnull()]
data.count()

leixing    2001
nianfen    2001
licheng    2001
didian     2001
shoujia    2001
yuanjia    1928
dtype: int64

In [142]:
data.dropna(axis=0,inplace=True)
data.count()

leixing    1928
nianfen    1928
licheng    1928
didian     1928
shoujia    1928
yuanjia    1928
dtype: int64

In [143]:
type(data["shoujia"])

pandas.core.series.Series

In [144]:
data["shoujia"].str.contains("万").sum()

1927

In [147]:
data = data[data["shoujia"].str.contains("万")]
data

,leixing,nianfen,licheng,didian,shoujia,yuanjia
0,凯迪拉克ATS-L 2016款 28T 时尚型,2016年,2.5万公里,长沙,16.77万,34.60万
1,奥迪A6L 2014款 TFSI 标准型,2014年,13.8万公里,长沙,21.96万,44.50万
2,本田 思域 2016款 1.8L 自动舒适版,2016年,4.8万公里,长沙,8.87万,15.20万
3,大众 朗逸 2015款 1.6L 自动舒适版,2016年,10.5万公里,长沙,7.27万,14.90万
15,Smart smart fortwo 2012款 1.0 MHD 硬顶标准版,2014年,5.6万公里,长沙,4.89万,12.50万
...,...,...,...,...,...,...
2005,大众 途观 2013款 1.8TSI 自动两驱舒适版,2014年,7.3万公里,长沙,13.50万,25.80万
2006,现代ix35 2012款 2.0L 自动两驱精英版GLS,2012年,7.1万公里,长沙,8.00万,21.30万
2007,宝马3系 2014款 320Li 时尚型,2015年,4.6万公里,长沙,23.00万,38.90万
2008,标致308 2014款 乐享版 经典 1.6L 手动优尚型,2015年,3.0万公里,长沙,6.20万,11.50万
2009,大众POLO 2014款 1.6L 自动舒适版,2016年,2.9万公里,长沙,7.40万,11.30万

In [150]:
data["shoujia"]=data["shoujia"].str.replace("万","")
data["yuanjia"]=data.yuanjia.map(lambda x: float(x.replace("万","")))
data

,leixing,nianfen,licheng,didian,shoujia,yuanjia
0,凯迪拉克ATS-L 2016款 28T 时尚型,2016年,2.5万公里,长沙,16.77,34.6
1,奥迪A6L 2014款 TFSI 标准型,2014年,13.8万公里,长沙,21.96,44.5
2,本田 思域 2016款 1.8L 自动舒适版,2016年,4.8万公里,长沙,8.87,15.2
3,大众 朗逸 2015款 1.6L 自动舒适版,2016年,10.5万公里,长沙,7.27,14.9
15,Smart smart fortwo 2012款 1.0 MHD 硬顶标准版,2014年,5.6万公里,长沙,4.89,12.5
...,...,...,...,...,...,...
2005,大众 途观 2013款 1.8TSI 自动两驱舒适版,2014年,7.3万公里,长沙,13.50,25.8
2006,现代ix35 2012款 2.0L 自动两驱精英版GLS,2012年,7.1万公里,长沙,8.00,21.3
2007,宝马3系 2014款 320Li 时尚型,2015年,4.6万公里,长沙,23.00,38.9
2008,标致308 2014款 乐享版 经典 1.6L 手动优尚型,2015年,3.0万公里,长沙,6.20,11.5
2009,大众POLO 2014款 1.6L 自动舒适版,2016年,2.9万公里,长沙,7.40,11.3